first_routes copy/app/controllers/artworks_controller.rb

    def create
        artwork = Artwork.new(artwork_params)
        if artwork.save
---
INSERT INTO "artworks" ("title", "img_url", "artist_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "mumbojumbo"], ["img_url", "bananapeel"], ["artist_id", 2], ["created_at", "2022-01-12 21:40:57.646892"], ["updated_at", "2022-01-12 21:40:57.646892"]]

    def update
        artwork = Artwork.find(params[:id])
        if artwork
            artwork.update(artwork_params)
---
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 20], ["LIMIT", 1]]
UPDATE "artworks" SET "title" = $1, "updated_at" = $2 WHERE "artworks"."id" = $3  [["title", "bye"], ["updated_at", "2022-01-12 22:20:46.501251"], ["id", 1]]

    def destroy
        artwork = Artwork.find(params[:id])
        if artwork
            artwork.destroy
---
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "artworks" WHERE "artworks"."id" = $1  [["id", 1]]