first_routes copy/app/controllers/users_controller.rb

    def index
        # render plain: "I'm in the index actions!"
        # users =
        render json: User.all
---
SELECT "users".* FROM "users"

    def create
        # debugger
        user = User.new(params.require(:user).permit(:name, :email))
        # replace the `user_attributes_here` with the actual attribute keys
        if user.save
---
INSERT INTO "users" ("name", "email") VALUES ($1, $2) RETURNING "id"  [["name", "jake"], ["email", "jake@email.com"]]

    def destroy
        user = User.find(params[:id])
        if user
            user.destroy
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 18], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 18]]

    def update
        user = User.find(params[:id])
        if user
            # debugger
            user.update(params.require(:user).permit(:name, :email))
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 18], ["LIMIT", 1]]
UPDATE "users" SET "email" = $1 WHERE "users"."id" = $2  [["email", "kevin@email.com"], ["id", 18]]